### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [120]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# Raw data file
file_to_load = "purchase_data.csv"

# Read purchasing file and store into pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [22]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [23]:
players = purchase_data["SN"].unique()
len(players)

576

In [24]:
players_data = {"Total Players": [len(players)]}
players_df = pd.DataFrame(data=players_data)
players_df.head()

   Total Players
0            576

In [25]:
purchases = purchase_data["Purchase ID"].unique()
len(purchases)

780

In [26]:
unique_items = purchase_data["Item ID"].unique()
len(unique_items)

183

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [27]:
avg_price = purchase_data["Price"].mean()

#avg_price = np.round(avg_price, decimals=2)
avg_price = "${:.2f}".format(avg_price)
avg_price

'$3.05'

In [28]:
purchase_data.shape[0]

780

In [29]:
total_revenue = purchase_data["Price"].sum()
total_revenue

2379.77

In [30]:
total_revenue_format = "${:,.2f}".format(total_revenue)
total_revenue_format

'$2,379.77'

In [31]:
purchase_analysis = {"Number of Unique Items":[len(unique_items)],"Average Price":[avg_price],
                     "Number of Purchases":[len(purchases)],"Total Revenue":[total_revenue_format]}
purchase_analysis_df = pd.DataFrame(data = purchase_analysis)
purchase_analysis_df

  Average Price  Number of Purchases  Number of Unique Items Total Revenue
0         $3.05                  780                     183     $2,379.77

In [32]:
cols = list(purchase_analysis_df.columns.values)
cols

['Average Price',
 'Number of Purchases',
 'Number of Unique Items',
 'Total Revenue']

In [13]:
#purchase_analysis_df = purchase_analysis_df[["Number of Unique Items","Average Price",
                                             #"Number of Purchases","Total Revenue"]]
#purchase_analysis_df

## Gender Demographics

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [14]:
genders = purchase_data["Gender"].value_counts()
genders

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [15]:
total_players = purchase_data["SN"].unique()
len(total_players)

576

In [16]:
males = purchase_data[purchase_data["Gender"] == "Male"].shape[0]
males

652

In [17]:
percentage_of_males = "{:.2f}".format((males/len(total_players))*100)
float(percentage_of_males)

113.19

In [18]:
females = len(purchase_data[purchase_data["Gender"] == "Female"])
females

113

In [19]:
other_gender = purchase_data[purchase_data["Gender"] == "Other / Non-Disclosed"].shape[0]
other_gender

15

In [126]:
gender_groups = purchase_data.copy()
gender_groups.drop_duplicates(subset=["SN"], inplace=True)
gender_groups.shape
gender_groups = gender_groups.groupby("Gender")
gender_groups_price = gender_groups["Price"].mean()

female_avg_price = "${:.2f}".format(gender_groups_price[0])
male_avg_price = "${:.2f}".format(gender_groups_price[1])
other_avg_price = "${:.2f}".format(gender_groups_price[2])

In [127]:
print(female_avg_price, male_avg_price, other_avg_price)

$3.17 $3.05 $3.41

In [79]:
other_avg_price

'$3.41'

In [80]:
gender_groups_total = gender_groups["Price"].sum()
female_total_price = "${:,.2f}".format(gender_groups_total[0])
male_total_price = "${:,.2f}".format(gender_groups_total[1])
other_total_price = "${:,.2f}".format(gender_groups_total[2])
print(female_total_price)
print(male_total_price)
print(other_total_price)

$256.43
$1,474.70
$37.52

In [81]:
norm_females = gender_groups_total[0]/females
norm_males = gender_groups_total[1]/males
norm_others = gender_groups_total[2]/other_gender

norm_fem = "${:.2f}".format(norm_females)
norm_mal = "${:.2f}".format(norm_males)
norm_oth = "${:.2f}".format(norm_others)

print(norm_fem)
print(norm_mal)
print(norm_oth)

$2.27
$2.26
$2.50

In [82]:
gender_data = {"Purchase Count":[females, males, other_gender],
               "Avg Purchase Price":[female_avg_price,male_avg_price,other_avg_price],
               "Total Purchase Price":[female_total_price,male_total_price,other_total_price],
               "Normalized Totals":[norm_fem,norm_mal,norm_oth]}
genders = ["Female", "Male", "Other / Non-Disclosed"]
gender_df = pd.DataFrame(data=gender_data, index=genders)
gender_df

,Avg Purchase Price,Normalized Totals,Purchase Count,Total Purchase Price
Female,$3.17,$2.27,113,$256.43
Male,$3.05,$2.26,652,"$1,474.70"
Other / Non-Disclosed,$3.41,$2.50,15,$37.52


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, etc. by gender


* For normalized purchasing, divide total purchase value by purchase count, by gender


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [121]:
age_bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99999]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [122]:
purchase_data["Age Groups"] = pd.cut(purchase_data["Age"], age_bins, labels=group_names)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Groups
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [123]:
grouped_age= pd.DataFrame({'Total Count' : purchase_data.groupby("Age Groups").size()}).reset_index()
grouped_age

  Age Groups  Total Count
0        <10           23
1      10-14           28
2      15-19          136
3      20-24          365
4      25-29          101
5      30-34           73
6      35-39           41
7        40+           13

In [132]:
grouped_age["Percentage"] = (grouped_age["Total Count"]/grouped_age["Total Count"].sum())*100
for i in range(0,len(grouped_age["Percentage"])):
    grouped_age["Percentage"][i]="{:.2f}".format(grouped_age["Percentage"][i])
grouped_age

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

  Age Groups  Total Count  Percentage
0        <10           23        2.95
1      10-14           28        3.59
2      15-19          136       17.44
3      20-24          365       46.79
4      25-29          101       12.95
5      30-34           73        9.36
6      35-39           41        5.26
7        40+           13        1.67

In [ ]:
total_by_group = grouped_age["Age Groups"].count()
total_by_group

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [ ]:
purchase_data.head()

In [ ]:
purchase_data

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, etc. in the table below


* Calculate Normalized Purchasing


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [181]:
age_analysis= pd.DataFrame({'Total Count' : purchase_data.groupby("Age Groups").size()}).reset_index()

In [182]:
gender_grouped = purchase_data.groupby("Age Groups")
total_spent = gender_grouped.sum()
total_spent

            Purchase ID   Age  Item ID    Price
Age Groups
<10               10009   181     2437    77.13
10-14             10114   319     2887    82.78
15-19             54859  2284    12798   412.89
20-24            139573  7971    32411  1114.06
25-29             41072  2626     9146   293.00
30-34             26254  2291     6875   214.00
35-39             16596  1505     4137   147.67
40+                5333   540     1158    38.24

In [183]:
total_spent.Price

Age Groups
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [187]:
age_analysis["Total Purchase"]=""

In [188]:
for i in range(0,len(total_spent.Price)):
    age_analysis["Total Purchase"][i]=total_spent.Price[i]

/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

In [189]:
age_analysis

  Age Groups  Total Count Total Purchase
0        <10           23          77.13
1      10-14           28          82.78
2      15-19          136         412.89
3      20-24          365        1114.06
4      25-29          101            293
5      30-34           73            214
6      35-39           41         147.67
7        40+           13          38.24

In [191]:
age_analysis["Normalized Price"] = age_analysis["Total Purchase"]/age_analysis["Total Count"]
age_analysis

  Age Groups  Total Count Total Purchase Normalized Price
0        <10           23          77.13          3.35348
1      10-14           28          82.78          2.95643
2      15-19          136         412.89          3.03596
3      20-24          365        1114.06          3.05222
4      25-29          101            293          2.90099
5      30-34           73            214          2.93151
6      35-39           41         147.67          3.60171
7        40+           13          38.24          2.94154

In [192]:
purchase_data_copy_2 = purchase_data.copy()
purchase_data_copy_2.groupby("Age Groups").mean()

            Purchase ID        Age     Item ID     Price
Age Groups
<10          435.173913   7.869565  105.956522  3.353478
10-14        361.214286  11.392857  103.107143  2.956429
15-19        403.375000  16.794118   94.102941  3.035956
20-24        382.391781  21.838356   88.797260  3.052219
25-29        406.653465  26.000000   90.554455  2.900990
30-34        359.643836  31.383562   94.178082  2.931507
35-39        404.780488  36.707317  100.902439  3.601707
40+          410.230769  41.538462   89.076923  2.941538

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [243]:
top_spenders = purchase_data.groupby("SN")
top_spenders = top_spenders["Price"].sum()
top_spend_5 = top_spenders.sort_values(ascending=False).head(5)

In [245]:
names = [top_spend_5.index.values[0],top_spend_5.index.values[1],
         top_spend_5.index.values[2],top_spend_5.index.values[3],
         top_spend_5.index.values[4]]
spending = [top_spend_5[0],top_spend_5[1],top_spend_5[2],top_spend_5[3],
            top_spend_5[4]]

In [246]:
purchase_count = []
for each in names:
    purchase_count.append(purchase_data[purchase_data['SN']==each].shape[0])

In [248]:
purchase_count

[5, 4, 3, 4, 3]

In [255]:
spendings = pd.DataFrame({"SN":names,"Purchase Count":purchase_count,"Total Purchase Value":spending})
spendings = spendings[["SN","Purchase Count","Total Purchase Value"]]
spendings["Average Purchase Price"] = spendings["Total Purchase Value"]/spendings["Purchase Count"]
spendings = spendings.style.format({"Average Purchase Price": "${:.2f}", "Total Purchase Value": "${:.2f}"})
spendings

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [309]:
popular_items = purchase_data[["Item ID","Item Name","Price"]]
popular_items = popular_items.groupby("Item Name")
popular_items = popular_items["Item Name"].count()
popular_items = popular_items_count.sort_values(ascending=False).head(5)
popular_items

Item Name
Final Critic                                    13
Oathbreaker, Last Hope of the Breaking Storm    12
Fiery Glass Crusader                             9
Persuasion                                       9
Nirvana                                          9
Name: Item Name, dtype: int64

In [310]:
popular_items.index.values[0]

'Final Critic'

In [373]:
popular_list = [popular_items.index.values[0],popular_items.index.values[1],
                popular_items.index.values[2],popular_items.index.values[3],
                popular_items.index.values[4]]
popular_count = [popular_items[0],popular_items[1],popular_items[2],
                 popular_items[3],popular_items[4]]

In [376]:
row_id = []
item_id = []
for each in popular_list:
    row_id.append(purchase_data[purchase_data['Item Name']==each]['Item ID'].index[0])
row_id

[2, 25, 132, 24, 18]

In [377]:
for each in row_id:
    item_id.append(purchase_data["Item ID"][each])
item_id

[92, 178, 145, 141, 82]

In [369]:
item_price = []
for each in row_id:
    item_price.append(purchase_data["Price"][each])
item_price

[4.88, 4.23, 4.58, 3.19, 4.9]

In [371]:
item_name = []
for each in row_id:
    item_name.append(purchase_data["Item Name"][each])
item_name

['Final Critic',
 'Oathbreaker, Last Hope of the Breaking Storm',
 'Fiery Glass Crusader',
 'Persuasion',
 'Nirvana']

In [381]:
popular_df = pd.DataFrame({"Item ID":item_id,"Item Name":item_name,"Total Count":popular_count,"Price":item_price})
popular_df["Total Purchase Value"] = popular_df["Price"] * popular_df["Total Count"]
pop_df_format = popular_df.style.format({"Price": "${:.2f}", "Total Purchase Value": "${:.2f}"})
pop_df_format

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [389]:
#profitable = popular_df.groupby("Total Purchase Value")
popular_df.dtypes

Item ID                   int64
Item Name                object
Price                   float64
Total Count               int64
Total Purchase Value    float64
dtype: object

In [391]:
profitable = popular_df.sort_values(by="Total Purchase Value", ascending=False)
profitable_format = profitable.style.format({"Price": "${:.2f}", "Total Purchase Value": "${:.2f}"})
profitable_format